Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler class provides the views that are visible.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.viewDrawers
All currently known view drawers.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.globalViewDrawer
The global view. Graphics drawn to the global view
are automatically drawn on all view drawers by TS Core.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler class.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.ViewOpened
Occurs when a view was opened.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.GlobalView
Gets the global view.
Graphics drawn to this view are drawn to all view drawers.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.GetViewInfo(System.Int32)
Get the view with the specified identifier.
identifier: The identifier.
Returns: The view with the specified identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.GetEnumerator
Returns an enumerator that iterates through the view drawers.
Returns: An System.Collections.Generic.IEnumerator`1 that can be used to iterate through the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through the view drawers.
Returns: An System.Collections.IEnumerator that can be used to iterate through the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.GetVisibleViewIdentifiers
Gets the visible views' identifier.
Returns: The identifiers of the visible views.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.OnViewChanged(System.String)
Called when a view has changed.
param: The parameter, expected to be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewChanged.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.OnViewClosed(System.String)
Called when a view was closed.
param: The parameter, expected to be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewClosed.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.OnViewOpened(System.String)
Called when a view was opened.
param:
The parameter, expected to be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewOpened.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.OnViewIdentifiersChanged(System.String)
Called when view identifiers might have changed.
param:
The parameter, expected to be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewIdentifiersChanged.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.AddViews(System.Collections.Generic.IEnumerable{System.Int32})
Adds the view drawers that have been opened.
currentViewIdentifiers: The current view identifiers.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewHandler.RemoveViews(System.Collections.Generic.IEnumerable{System.Int32})
Removes the view drawers that are no longer open.
currentViewIdentifiers: The current view identifiers.